experiment_results/ftl_hotcold/v1/20260819_025314_KST/runs/T64/fio.txt
2026-08-18T18:16:21+00:00
v1-t64: (g=0): rw=randwrite, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=libaio, iodepth=128
...
fio-3.16
Starting 32 processes

v1-t64: (groupid=0, jobs=32): err= 0: pid=1408: Tue Aug 18 18:21:29 2026
  write: IOPS=8514, BW=133MiB/s (140MB/s)(39.1GiB/300710msec); 0 zone resets
    slat (usec): min=2, max=1534.2k, avg=3061.15, stdev=15469.82
    clat (usec): min=1629, max=3738.2k, avg=476144.28, stdev=216239.23
     lat (usec): min=1689, max=3738.3k, avg=479208.12, stdev=216874.89
    clat percentiles (msec):
     |  1.00th=[   97],  5.00th=[  203], 10.00th=[  251], 20.00th=[  317],
     | 30.00th=[  368], 40.00th=[  401], 50.00th=[  447], 60.00th=[  498],
     | 70.00th=[  558], 80.00th=[  617], 90.00th=[  726], 95.00th=[  827],
     | 99.00th=[ 1083], 99.50th=[ 1267], 99.90th=[ 2299], 99.95th=[ 2769],
     | 99.99th=[ 3037]
   bw (  KiB/s): min= 1207, max=135983, per=27.26%, avg=37135.99, stdev=489.89, samples=19001
   iops        : min=   62, max= 8483, avg=2306.09, stdev=30.62, samples=19001
  lat (msec)   : 2=0.01%, 4=0.02%, 10=0.08%, 20=0.01%, 50=0.25%
  lat (msec)   : 100=0.77%, 250=8.81%, 500=50.78%, 750=30.89%, 1000=6.85%
  lat (msec)   : 2000=1.40%, >=2000=0.14%
  cpu          : usr=0.49%, sys=0.94%, ctx=679475, majf=0, minf=384
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,2560515,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=133MiB/s (140MB/s), 133MiB/s-133MiB/s (140MB/s-140MB/s), io=39.1GiB (41.0GB), run=300710-300710msec

Disk stats (read/write):
  nvme0n1: ios=60/2558371, merge=0/0, ticks=681/911452282, in_queue=906341044, util=99.51%
2026-08-18T18:21:30+00:00
measurement_rc=0